tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "withgraphite/tap"

brew "mas"
brew "zoxide"
brew "jq"
brew "yq"
brew "yj"
brew "yj"
brew "rg"
brew "fd"
brew "gh"
brew "bat"
brew "starship"
brew "curl"
brew "wget"
brew "grep"
brew "tealdeer"
brew "coreutils"
brew "gnu-sed"
brew "gnu-tar"
brew "pcre"
brew "moreutils"
brew "graphite"

cask "font-fira-code-nerd-font"
cask "iterm2"
cask "grid"
cask "intellidock"
cask "komet"
cask "visual-studio-code"
cask "jetbrains-toolbox"
cask "setapp"
cask "logi-options-plus"

mas "Refined GitHub", id: 1519867270
mas "AdGuard for Safari", id: 1440147259
mas "StopTheMadness", id: 1376402589
mas "1Password for Safari", id: 1569813296
mas "Hush", id: 1544743900

# stuff for headway

brew "fnm"
brew "python3"
brew "tmux"
brew "pyenv"
brew "pyenv-virtualenv"
brew "yarn"
brew "postgresql@14"
brew "redis"
brew "watchman"
brew "openssl"
brew "maven"
brew "awscli"

cask "temurin"
cask "docker"
cask "aws-vault"
cask "tableplus"
